#!/bin/bash


echo "========================================="
echo "        ЧИСЛОВОЙ ФИЛЬТР"
echo "========================================="
echo

for i in {1..20}; do
    
    echo "→ Проверяем число: $i"
    
        if [ $i -eq 15 ]; then
        echo "   ⚠️  Достигнуто число 15! Прерываем работу цикла."
        break
    fi
    
        if [ $((i % 2)) -eq 0 ]; then
        echo "   Чётное число $i — пропускаем (continue)"
        continue
    fi
    
       echo "   ✅ Нечётное число: $i"
    
done

echo
echo "========================================="
echo "        ЦИКЛ ЗАВЕРШЁН"
echo "========================================="
